testSuite/compressible/1D/RiemannProblems/SodShockTube/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        system;
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
type sets;
libs ("libsampling.so");

setFormat raw;

interpolationScheme cell;

// Fields to sample.
fields
(
 rho p T U
);

sets
(
    lineX1
    {
        type        midPoint;
        axis        distance;
        start       (-5.0 0.0 0.0);
        end         (5.0 0.0 0.0);
    }
);

// *********************************************************************** //
